###############################################################################
# Created by write_sdc
###############################################################################
current_design clarke
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rstb}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {start}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alpha[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alpha[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alpha[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alpha[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alpha[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alpha[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alpha[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alpha[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alpha[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alpha[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alpha[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alpha[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alpha[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alpha[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alpha[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alpha[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alpha[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alpha[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alpha[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {beta[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {beta[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {beta[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {beta[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {beta[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {beta[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {beta[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {beta[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {beta[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {beta[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {beta[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {beta[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {beta[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {beta[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {beta[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {beta[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {beta[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {beta[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {beta[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {done}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {done}]
set_load -pin_load 0.0334 [get_ports {alpha[18]}]
set_load -pin_load 0.0334 [get_ports {alpha[17]}]
set_load -pin_load 0.0334 [get_ports {alpha[16]}]
set_load -pin_load 0.0334 [get_ports {alpha[15]}]
set_load -pin_load 0.0334 [get_ports {alpha[14]}]
set_load -pin_load 0.0334 [get_ports {alpha[13]}]
set_load -pin_load 0.0334 [get_ports {alpha[12]}]
set_load -pin_load 0.0334 [get_ports {alpha[11]}]
set_load -pin_load 0.0334 [get_ports {alpha[10]}]
set_load -pin_load 0.0334 [get_ports {alpha[9]}]
set_load -pin_load 0.0334 [get_ports {alpha[8]}]
set_load -pin_load 0.0334 [get_ports {alpha[7]}]
set_load -pin_load 0.0334 [get_ports {alpha[6]}]
set_load -pin_load 0.0334 [get_ports {alpha[5]}]
set_load -pin_load 0.0334 [get_ports {alpha[4]}]
set_load -pin_load 0.0334 [get_ports {alpha[3]}]
set_load -pin_load 0.0334 [get_ports {alpha[2]}]
set_load -pin_load 0.0334 [get_ports {alpha[1]}]
set_load -pin_load 0.0334 [get_ports {alpha[0]}]
set_load -pin_load 0.0334 [get_ports {beta[18]}]
set_load -pin_load 0.0334 [get_ports {beta[17]}]
set_load -pin_load 0.0334 [get_ports {beta[16]}]
set_load -pin_load 0.0334 [get_ports {beta[15]}]
set_load -pin_load 0.0334 [get_ports {beta[14]}]
set_load -pin_load 0.0334 [get_ports {beta[13]}]
set_load -pin_load 0.0334 [get_ports {beta[12]}]
set_load -pin_load 0.0334 [get_ports {beta[11]}]
set_load -pin_load 0.0334 [get_ports {beta[10]}]
set_load -pin_load 0.0334 [get_ports {beta[9]}]
set_load -pin_load 0.0334 [get_ports {beta[8]}]
set_load -pin_load 0.0334 [get_ports {beta[7]}]
set_load -pin_load 0.0334 [get_ports {beta[6]}]
set_load -pin_load 0.0334 [get_ports {beta[5]}]
set_load -pin_load 0.0334 [get_ports {beta[4]}]
set_load -pin_load 0.0334 [get_ports {beta[3]}]
set_load -pin_load 0.0334 [get_ports {beta[2]}]
set_load -pin_load 0.0334 [get_ports {beta[1]}]
set_load -pin_load 0.0334 [get_ports {beta[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rstb}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {start}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
