###############################################################################
# Created by write_sdc
###############################################################################
current_design cordic
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_valid}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rstb}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {theta[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {theta[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {theta[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {theta[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {theta[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {theta[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {theta[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {theta[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {theta[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {theta[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {theta[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {theta[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {theta[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {theta[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {theta[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {theta[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {cos[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {cos[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {cos[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {cos[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {cos[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {cos[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {cos[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {cos[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {cos[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {cos[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {cos[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {cos[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {cos[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {cos[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {cos[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {cos[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_valid}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ready}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sin[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sin[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sin[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sin[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sin[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sin[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sin[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sin[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sin[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sin[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sin[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sin[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sin[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sin[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sin[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sin[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {out_valid}]
set_load -pin_load 0.0334 [get_ports {ready}]
set_load -pin_load 0.0334 [get_ports {cos[15]}]
set_load -pin_load 0.0334 [get_ports {cos[14]}]
set_load -pin_load 0.0334 [get_ports {cos[13]}]
set_load -pin_load 0.0334 [get_ports {cos[12]}]
set_load -pin_load 0.0334 [get_ports {cos[11]}]
set_load -pin_load 0.0334 [get_ports {cos[10]}]
set_load -pin_load 0.0334 [get_ports {cos[9]}]
set_load -pin_load 0.0334 [get_ports {cos[8]}]
set_load -pin_load 0.0334 [get_ports {cos[7]}]
set_load -pin_load 0.0334 [get_ports {cos[6]}]
set_load -pin_load 0.0334 [get_ports {cos[5]}]
set_load -pin_load 0.0334 [get_ports {cos[4]}]
set_load -pin_load 0.0334 [get_ports {cos[3]}]
set_load -pin_load 0.0334 [get_ports {cos[2]}]
set_load -pin_load 0.0334 [get_ports {cos[1]}]
set_load -pin_load 0.0334 [get_ports {cos[0]}]
set_load -pin_load 0.0334 [get_ports {sin[15]}]
set_load -pin_load 0.0334 [get_ports {sin[14]}]
set_load -pin_load 0.0334 [get_ports {sin[13]}]
set_load -pin_load 0.0334 [get_ports {sin[12]}]
set_load -pin_load 0.0334 [get_ports {sin[11]}]
set_load -pin_load 0.0334 [get_ports {sin[10]}]
set_load -pin_load 0.0334 [get_ports {sin[9]}]
set_load -pin_load 0.0334 [get_ports {sin[8]}]
set_load -pin_load 0.0334 [get_ports {sin[7]}]
set_load -pin_load 0.0334 [get_ports {sin[6]}]
set_load -pin_load 0.0334 [get_ports {sin[5]}]
set_load -pin_load 0.0334 [get_ports {sin[4]}]
set_load -pin_load 0.0334 [get_ports {sin[3]}]
set_load -pin_load 0.0334 [get_ports {sin[2]}]
set_load -pin_load 0.0334 [get_ports {sin[1]}]
set_load -pin_load 0.0334 [get_ports {sin[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_valid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rstb}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {theta[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {theta[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {theta[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {theta[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {theta[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {theta[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {theta[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {theta[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {theta[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {theta[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {theta[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {theta[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {theta[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {theta[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {theta[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {theta[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
