###############################################################################
# Created by write_sdc
###############################################################################
current_design top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 1000.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {angle_in[0]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {angle_in[10]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {angle_in[11]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {angle_in[12]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {angle_in[13]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {angle_in[14]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {angle_in[15]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {angle_in[1]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {angle_in[2]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {angle_in[3]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {angle_in[4]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {angle_in[5]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {angle_in[6]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {angle_in[7]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {angle_in[8]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {angle_in[9]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currA_in[0]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currA_in[10]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currA_in[11]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currA_in[12]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currA_in[13]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currA_in[14]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currA_in[15]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currA_in[1]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currA_in[2]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currA_in[3]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currA_in[4]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currA_in[5]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currA_in[6]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currA_in[7]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currA_in[8]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currA_in[9]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currB_in[0]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currB_in[10]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currB_in[11]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currB_in[12]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currB_in[13]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currB_in[14]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currB_in[15]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currB_in[1]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currB_in[2]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currB_in[3]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currB_in[4]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currB_in[5]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currB_in[6]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currB_in[7]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currB_in[8]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currB_in[9]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currC_in[0]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currC_in[10]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currC_in[11]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currC_in[12]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currC_in[13]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currC_in[14]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currC_in[15]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currC_in[1]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currC_in[2]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currC_in[3]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currC_in[4]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currC_in[5]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currC_in[6]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currC_in[7]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currC_in[8]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currC_in[9]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currT_in[0]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currT_in[10]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currT_in[11]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currT_in[12]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currT_in[13]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currT_in[14]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currT_in[15]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currT_in[1]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currT_in[2]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currT_in[3]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currT_in[4]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currT_in[5]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currT_in[6]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currT_in[7]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currT_in[8]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {currT_in[9]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {periodTop[0]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {periodTop[10]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {periodTop[11]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {periodTop[12]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {periodTop[13]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {periodTop[14]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {periodTop[15]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {periodTop[1]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {periodTop[2]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {periodTop[3]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {periodTop[4]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {periodTop[5]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {periodTop[6]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {periodTop[7]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {periodTop[8]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {periodTop[9]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_addr[0]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_addr[10]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_addr[11]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_addr[12]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_addr[13]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_addr[14]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_addr[15]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_addr[1]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_addr[2]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_addr[3]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_addr[4]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_addr[5]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_addr[6]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_addr[7]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_addr[8]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_addr[9]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_data[0]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_data[10]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_data[11]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_data[12]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_data[13]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_data[14]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_data[15]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_data[1]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_data[2]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_data[3]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_data[4]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_data[5]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_data[6]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_data[7]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_data[8]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_data[9]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_d_wen}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_addr[0]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_addr[10]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_addr[11]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_addr[12]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_addr[13]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_addr[14]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_addr[15]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_addr[1]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_addr[2]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_addr[3]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_addr[4]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_addr[5]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_addr[6]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_addr[7]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_addr[8]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_addr[9]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_data[0]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_data[10]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_data[11]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_data[12]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_data[13]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_data[14]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_data[15]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_data[1]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_data[2]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_data[3]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_data[4]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_data[5]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_data[6]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_data[7]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_data[8]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_data[9]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pid_q_wen}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rstb}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {valid}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pwmA_out}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pwmB_out}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pwmC_out}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ready}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {pwmA_out}]
set_load -pin_load 0.0334 [get_ports {pwmB_out}]
set_load -pin_load 0.0334 [get_ports {pwmC_out}]
set_load -pin_load 0.0334 [get_ports {ready}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_wen}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_wen}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rstb}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {valid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {angle_in[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {angle_in[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {angle_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {angle_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {angle_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {angle_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {angle_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {angle_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {angle_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {angle_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {angle_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {angle_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {angle_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {angle_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {angle_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {angle_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currA_in[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currA_in[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currA_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currA_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currA_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currA_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currA_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currA_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currA_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currA_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currA_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currA_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currA_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currA_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currA_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currA_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currB_in[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currB_in[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currB_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currB_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currB_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currB_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currB_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currB_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currB_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currB_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currB_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currB_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currB_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currB_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currB_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currB_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currC_in[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currC_in[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currC_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currC_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currC_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currC_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currC_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currC_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currC_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currC_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currC_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currC_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currC_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currC_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currC_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currC_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currT_in[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currT_in[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currT_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currT_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currT_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currT_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currT_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currT_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currT_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currT_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currT_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currT_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currT_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currT_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currT_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {currT_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {periodTop[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {periodTop[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {periodTop[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {periodTop[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {periodTop[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {periodTop[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {periodTop[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {periodTop[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {periodTop[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {periodTop[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {periodTop[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {periodTop[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {periodTop[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {periodTop[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {periodTop[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {periodTop[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_addr[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_addr[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_addr[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_addr[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_addr[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_addr[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_addr[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_addr[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_addr[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_addr[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_addr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_addr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_addr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_addr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_data[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_data[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_data[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_data[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_data[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_data[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_data[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_data[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_data[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_data[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_data[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_data[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_data[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_data[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_data[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_d_data[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_addr[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_addr[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_addr[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_addr[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_addr[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_addr[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_addr[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_addr[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_addr[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_addr[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_addr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_addr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_addr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_addr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_data[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_data[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_data[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_data[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_data[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_data[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_data[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_data[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_data[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_data[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_data[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_data[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_data[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_data[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_data[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pid_q_data[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
